<template><div><h2 id="第1章-好词" tabindex="-1"><a class="header-anchor" href="#第1章-好词" aria-hidden="true">#</a> 第1章 好词</h2>
<p>牛渚燃犀：点燃犀牛角来照看，比喻洞察奸邪。</p>
<h2 id="第2章-好句" tabindex="-1"><a class="header-anchor" href="#第2章-好句" aria-hidden="true">#</a> 第2章 好句</h2>
<p>未曾清贫难成人,不经打击老天真。自古英雄出炼狱,从来富贵入凡尘。</p>
<p>成熟不过是善于隐藏，沧桑不过是无泪有伤。</p>
<p>伤心人以冷笑代呜咽。</p>
<p>人不会白白付出,人一定会不自觉的寻求回报。</p>
<p>因为我也是个小鬼,正因如此,才要装成大人,对他发号施令,不想暴露自己和小鬼差不了多少,所以采取不理睬的态度。</p>
<p>多想象自己成功时候的场景,这样更容易成功。</p>
<p>你越是以自己某一身份为傲，你越有动力保持与之相关的习惯。</p>
<p>人格身份不是与生俱来的，但是你可以决定你想要成为什么样的人，</p>
<p>新的身份需要新的证据。</p>
<p>你的目标不应该是得到什么样结果，而是变成什么样的人。</p>
<p>把愤怒当成是一种愚蠢的行为。</p>
<p>直到很久以后，我也会记得，有个人，温柔了我整个青春。</p>
<h2 id="第3章-好文" tabindex="-1"><a class="header-anchor" href="#第3章-好文" aria-hidden="true">#</a> 第3章 好文</h2>
</div></template>
