<template><div><h2 id="第1章-测试基础" tabindex="-1"><a class="header-anchor" href="#第1章-测试基础" aria-hidden="true">#</a> 第1章 测试基础</h2>
<h3 id="_1-1-软件测试的定义" tabindex="-1"><a class="header-anchor" href="#_1-1-软件测试的定义" aria-hidden="true">#</a> 1.1 软件测试的定义</h3>
<p>（1）IEEE：通过人工或者自动化的手段执行某个程序或者运行某个系统的过程，其目的是为了验证符合规定的需求以及发现实际结果和预期结果之间的偏差。</p>
<p>（2）Glenford J.Mayer： 测试是为了发现缺陷，好的测试方案是发现了迄今为止未发现缺陷的方案，成功的测试是发现了迄今为止未发现的缺陷。</p>
<h3 id="_1-2-测试的目的" tabindex="-1"><a class="header-anchor" href="#_1-2-测试的目的" aria-hidden="true">#</a> 1.2 测试的目的</h3>
<p><em><strong>*（1）证明*</strong></em></p>
<p>①60年代</p>
<p>②证明软件可用，能够满足需求</p>
<p>③测试是不能穷尽的，不能百分之百证明软件没有问题</p>
<p><em><strong>*（2）检测*</strong></em></p>
<p>①70年代</p>
<p>②发现软件系统的不足，除了功能方面，对其他方面比如性能；易用性可靠性提出更多的要求</p>
<p>③针对不足与问题要做分析</p>
<p><em><strong>*（3）预防*</strong></em></p>
<p>①90年代~至今</p>
<p>②全面管理质量，做好预防</p>
<p>③测试工作要尽早</p>
<h2 id="第2章-软件生命周期" tabindex="-1"><a class="header-anchor" href="#第2章-软件生命周期" aria-hidden="true">#</a> 第2章 软件生命周期</h2>
<p><strong>计划--》需求分析--》设计--》编码实现--》测试--》运行与维护--》评价</strong></p>
<h2 id="第3章-软件的开发过程" tabindex="-1"><a class="header-anchor" href="#第3章-软件的开发过程" aria-hidden="true">#</a> 第3章 软件的开发过程</h2>
<h3 id="_3-1-软件开发模型" tabindex="-1"><a class="header-anchor" href="#_3-1-软件开发模型" aria-hidden="true">#</a> 3.1 软件开发模型</h3>
<p>（1） 顺序开发模型</p>
<p>​    ①瀑布模型</p>
<p>​    ②V模型</p>
<p>（2）迭代-增量开发模型</p>
<p>①螺旋模型</p>
<p>②RUP模型</p>
<p>③IPPD模型</p>
<h2 id="第4章-常用的测试术语" tabindex="-1"><a class="header-anchor" href="#第4章-常用的测试术语" aria-hidden="true">#</a> 第4章 常用的测试术语</h2>
<p>​    ①测试用例</p>
<p>​    ②缺陷</p>
<p>​</p>
<h2 id="第5章-软件测试流程" tabindex="-1"><a class="header-anchor" href="#第5章-软件测试流程" aria-hidden="true">#</a> 第5章 软件测试流程</h2>
<h3 id="_5-1-单元测试" tabindex="-1"><a class="header-anchor" href="#_5-1-单元测试" aria-hidden="true">#</a> 5.1 单元测试</h3>
<p>（1）概念</p>
<p>针对组成软件系统的最基本的单位（<strong>函数或者类</strong>）进行测试，叫做单元测试，也称组件测试。</p>
<p>（2）测试依据</p>
<p>详细设计说明书（LLD）</p>
<p>（3）方法</p>
<p>白盒测试方法为主</p>
<p>（4）考察基准</p>
<p>逻辑覆盖率</p>
<p>（5）英文</p>
<p>Unit Testing（UT）或Component Testing（组件测试）</p>
<p>（6）补充</p>
<p>孤立的测试策略：自顶向下，自底向上</p>
<h3 id="_5-2-集成测试" tabindex="-1"><a class="header-anchor" href="#_5-2-集成测试" aria-hidden="true">#</a> 5.2 集成测试</h3>
<p>（1）概念</p>
<p>将测试完成的单元进行组装，或者将组装好的模块集成为系统，叫做集成测试。</p>
<p>（2）测试依据</p>
<p>概要设计说明书（HLD）</p>
<p>（3）方法</p>
<p>灰盒（黑盒+白盒）测试方法为主</p>
<p>（4）考察基准</p>
<p>接口覆盖率</p>
<p>（5）英文</p>
<p>Integration Testing（IT）</p>
<p>（6）补充</p>
<p>大爆炸集成，自顶向下，自底向上，三明治集成</p>
<h3 id="_5-3-系统测试" tabindex="-1"><a class="header-anchor" href="#_5-3-系统测试" aria-hidden="true">#</a> 5.3 系统测试</h3>
<p>（1）概念</p>
<p>将组装完成的软件系统作为一个元素和其他软件或者硬件系统集成在一起的测试，叫做系统测试。</p>
<p>（2）测试依据</p>
<p>软件需求规格说明书（SRS）</p>
<p>（3）方法</p>
<p>黑盒测试方法为主</p>
<p>（4）考察基准</p>
<p>需求覆盖率</p>
<p>（5）英文</p>
<p>System Testing（ST）</p>
<p>（6）补充</p>
<p>常见的系统测试类型：功能测试，性能测试，安全测试，易用性测试</p>
<h3 id="_5-4-验收测试" tabindex="-1"><a class="header-anchor" href="#_5-4-验收测试" aria-hidden="true">#</a> 5.4 验收测试</h3>
<p>（1）概念</p>
<p>用户参与的测试叫做验收测试（验收合同或者潜在用户参与的测试）。</p>
<p>（2）依据</p>
<p>验收合同，用户的原始需求</p>
<p>（3）方法</p>
<p>黑盒测试方法</p>
<p>（4）考察基准</p>
<p>原始需求覆盖率</p>
<p>（5）英文</p>
<p>User Acceptance Testing（UAT）</p>
<p>（6）补充</p>
<p>Alpha测试（内测）</p>
<p>潜在用户在开发现场，有开发人员进行记录，整个测试过程可控。</p>
<p>Beta测试（公测）</p>
<p>直接发布到市场，没有开发人员记录，环境比较复杂多样，整个测试过程不可控。</p>
<h3 id="_5-5-回归测试" tabindex="-1"><a class="header-anchor" href="#_5-5-回归测试" aria-hidden="true">#</a> 5.5 回归测试</h3>
<p>（1）概念</p>
<p>执行用例失败而提交了缺陷，针对缺陷修改后再次验证缺陷是否修改正确以及缺陷修改后受到影响的测试用例再次测试；回归测试发生在任何阶段。</p>
<p>（2）流程</p>
<p>①在测试方案中确定回归测试的版本</p>
<p>②等待回归测试版本发布</p>
<p>③回归测试版本发布</p>
<p>④回归测试（按照确定回归测试策略）</p>
<p>（3）策略</p>
<p>完全重复回归测试</p>
<p>选择重复回归测试（周边影响法；指标达成法；覆盖修改法）</p>
<h2 id="第6章-软件测试模型" tabindex="-1"><a class="header-anchor" href="#第6章-软件测试模型" aria-hidden="true">#</a> 第6章 软件测试模型</h2>
<h3 id="_6-1-瀑布模型" tabindex="-1"><a class="header-anchor" href="#_6-1-瀑布模型" aria-hidden="true">#</a> 6.1 瀑布模型</h3>
<p><img src="@source/document/编程基础/asset/watermark,type_d3F5LXplbmhlaQ,shadow_50,text_Q1NETiBA54us55y85YmR5a6i,size_20,color_FFFFFF,t_70,g_se,x_16.png" alt="img" loading="lazy"></p>
<h3 id="_6-2-v模型" tabindex="-1"><a class="header-anchor" href="#_6-2-v模型" aria-hidden="true">#</a> 6.2 V模型</h3>
<p><img src="@source/document/编程基础/asset/watermark,type_d3F5LXplbmhlaQ,shadow_50,text_Q1NETiBA54us55y85YmR5a6i,size_20,color_FFFFFF,t_70,g_se,x_16-16562895724471.png" alt="img" loading="lazy"></p>
<h3 id="_6-3-h模型" tabindex="-1"><a class="header-anchor" href="#_6-3-h模型" aria-hidden="true">#</a> 6.3 H模型</h3>
<p><img src="@source/document/编程基础/asset/watermark,type_d3F5LXplbmhlaQ,shadow_50,text_Q1NETiBA54us55y85YmR5a6i,size_20,color_FFFFFF,t_70,g_se,x_16-16562895724472.png" alt="img" loading="lazy"></p>
<h3 id="_6-4-双v模型-verification-and-validation" tabindex="-1"><a class="header-anchor" href="#_6-4-双v模型-verification-and-validation" aria-hidden="true">#</a> 6.4 双V模型（Verification and Validation）</h3>
<p><img src="@source/document/编程基础/asset/watermark,type_d3F5LXplbmhlaQ,shadow_50,text_Q1NETiBA54us55y85YmR5a6i,size_20,color_FFFFFF,t_70,g_se,x_16-16562895724473.png" alt="img" loading="lazy"></p>
<h2 id="第7章-测试活动与规范" tabindex="-1"><a class="header-anchor" href="#第7章-测试活动与规范" aria-hidden="true">#</a> 第7章 测试活动与规范</h2>
<h3 id="_7-1-测试计划" tabindex="-1"><a class="header-anchor" href="#_7-1-测试计划" aria-hidden="true">#</a> 7.1 测试计划</h3>
<p>针对测试阶段做规划：</p>
<p>①时间的安排</p>
<p>②人员安排</p>
<p>③任务的分配</p>
<p>④测试目标的要求</p>
<p>⑤测试范围的划定</p>
<p>⑥测试计划文档（单元测试计划；系统测试计划；集成测试计划；验收测试计划）</p>
<h3 id="_7-2-测试设计" tabindex="-1"><a class="header-anchor" href="#_7-2-测试设计" aria-hidden="true">#</a> 7.2 测试设计</h3>
<p>①针对测试计划给出时间要求，给定的人员要完成分配的测试任务进行各种策略（详细说明怎么做：具体的工具；方法；模板；任务的顺序）</p>
<p>②测试方案文档（单元测试方案；集成测试方案；系统测试方案；验收测试方案）</p>
<h3 id="_7-3-测试实现" tabindex="-1"><a class="header-anchor" href="#_7-3-测试实现" aria-hidden="true">#</a> 7.3 测试实现</h3>
<p>①针对方案中给出如何编写测试用例，编写测试脚本完成测试用例；测试脚本以及测试规程</p>
<p>②测试用例（单元测试用例；集成测试用例；系统测试用例；验收测试用例）</p>
<p>③测试脚本（单元测试脚本；集成测试脚本；系统测试脚本；验收测试脚本）</p>
<p>④测试规程（单元测试规程；集成测试规程；系统测试规程；验收测试规程）</p>
<p>⑤测试规程（Test Procedure）：规定一组测试用例的执行顺序</p>
<h3 id="_7-4-测试执行" tabindex="-1"><a class="header-anchor" href="#_7-4-测试执行" aria-hidden="true">#</a> 7.4 测试执行</h3>
<p>针对计划中安排的测试执行时间、人员、按照方案中给定的环境搭建数据选取等策略，对测试实现中的用例，脚本按照测试规程编排的顺序执行，具体的测试执行工作：</p>
<p>①搭建测试环境</p>
<p>②准备测试数据</p>
<p>③执行测试用例</p>
<p>④记录测试用例执行结果</p>
<p>⑤提交缺陷</p>
<p>⑥跟踪缺陷</p>
<p>⑦回归测试</p>
<p>⑧测试报告</p>
<h2 id="第8章-测试方法及分类" tabindex="-1"><a class="header-anchor" href="#第8章-测试方法及分类" aria-hidden="true">#</a> 第8章 测试方法及分类</h2>
<h3 id="_8-1-黑盒测试和白盒测试" tabindex="-1"><a class="header-anchor" href="#_8-1-黑盒测试和白盒测试" aria-hidden="true">#</a> 8.1 黑盒测试和白盒测试</h3>
<p>（1）白盒测试（White Box Testing）</p>
<p>①概念：针对软件系统的内部细节做测试，考察内部的逻辑结构，好比盒子是开发的或者透明的，所以叫做白盒测试。（Open Box Testing；Glass Box Testing；Logic Driven Testing）</p>
<p>②白盒的静态测试：控制流分析，数据流分析，信息流分析</p>
<p>③白盒的动态测试：程序插装与逻辑覆盖率</p>
<p>【解析】</p>
<p>程序插装：将测试代码插入到被测试代码，通过运行插入测试代码的程序得出测试结果，查出被测试代码中是否有问题。</p>
<p>逻辑覆盖率：语句覆盖率；判定覆盖率；条件覆盖率；路径覆盖率</p>
<p>④白盒测试特点</p>
<p>优点：问题发生容易定位</p>
<p>​      测试的比较彻底</p>
<p>​      解决问题的成本比较低</p>
<p>缺点：对测试人员的代码能力要求高</p>
<p>​      测试的工作的工作量大</p>
<p>​      测试的成本比较高</p>
<p>​      对规格问题不做验证</p>
<p>（2）黑盒测试（Black Box Testing）</p>
<p>①概念：</p>
<p>针对软件系统的整体规格做测试，看不到内部的细节结构，好比一个黑色的盒子，所以叫黑盒测试</p>
<p>②黑盒的方法</p>
<p>等价类划分法；边界值分析法；判定表法；因果图法；正交实验法；状态迁移图法；流程分析法</p>
<p>③常见的黑盒测试类型</p>
<p>功能测试；性能测试；负载测试；容量测试</p>
<p>④黑盒测试特点</p>
<p>优点：对代码能力要求低，只测试最终的贵，测试效率高，容易理解</p>
<p>缺点：解决问题的成本高，问题定位比较难，不测试软件系统内部细节逻辑结果，对软件需求规格说明书的要求比较高</p>
<p>（3）灰盒测试</p>
<p>①概念：综合运用黑盒测试与白盒测试，灰度取决于被测试对象的颗粒度</p>
<h3 id="_8-2-静态测试和动态测试" tabindex="-1"><a class="header-anchor" href="#_8-2-静态测试和动态测试" aria-hidden="true">#</a> 8.2 静态测试和动态测试</h3>
<p>（1）静态测试</p>
<p>①概念</p>
<p>被测试对象没有被运行（比如代码的编译，文档的评审），主要是针对软件生产过程中的中间产品</p>
<p>②自动化手段（静态分析，语法分析，符号执行）</p>
<p>③人工手段（评审：代码走读；设计文档技术评审；需求规格说明书的正规检视）</p>
<p>④正规检视：必须严格遵守流程规范（角色分配；活动安排），目的是为了发现缺陷</p>
<p>⑤技术评审：对技术文档进行评估，选择方案</p>
<p>⑥走读：形式比较随意，作者自己讲解，目的是为了发现缺陷，同时可以交流学习</p>
<p>（2）动态测试</p>
<p>概念：被测试对象被运行</p>
<h3 id="_8-3-自动化测试和人工测试" tabindex="-1"><a class="header-anchor" href="#_8-3-自动化测试和人工测试" aria-hidden="true">#</a> 8.3 自动化测试和人工测试</h3>
<p>（1）人工测试</p>
<p>需要智能的，执行一次的</p>
<p>（2）自动化测试</p>
<p>机械的重复的，不需要智能的，人工无法完成的（大并发量，查看微妙级的时间相应的）</p>
<h2 id="第9章-软件质量" tabindex="-1"><a class="header-anchor" href="#第9章-软件质量" aria-hidden="true">#</a> 第9章 软件质量</h2>
<h3 id="_9-1-软件质量的概念" tabindex="-1"><a class="header-anchor" href="#_9-1-软件质量的概念" aria-hidden="true">#</a> 9.1 软件质量的概念</h3>
<p>软件这类产品基于软件特性的满足条件（ISO9126）</p>
<h3 id="_9-2-软件质量铁三角" tabindex="-1"><a class="header-anchor" href="#_9-2-软件质量铁三角" aria-hidden="true">#</a> 9.2 软件质量铁三角</h3>
<p>（1）流程</p>
<p>为生产某个产品而进行的一系列相关联的活动，将最终目标分解到各个活动使得整个生产过程可见</p>
<p>（2）技术</p>
<p>①技术本身</p>
<p>②技术人才</p>
<p>③工作经验</p>
<p>④专利</p>
<p>⑤案例库开发技术</p>
<p>⑥黑盒测试技术</p>
<p>⑦白盒测试技术</p>
<p>⑧自动化技术</p>
<p>⑨测试分析技术</p>
<p>⑩测试设计技术</p>
<p>（3）组织</p>
<p>间接影响软件质量</p>
<p>①对流程：引进流程；按照流程执行；监督流程；改进流程</p>
<p>②对技术：引进新技术；购买设备仪器；吸引技术人才；案例库；专利的申请</p>
<h3 id="_9-3-件质量模型" tabindex="-1"><a class="header-anchor" href="#_9-3-件质量模型" aria-hidden="true">#</a> 9.3 件质量模型</h3>
<p><em><strong>*（1）功能性*</strong></em></p>
<p>| 子特性     | 说明                                                         | 举例                                                         |</p>
<p>| ---------- | ------------------------------------------------------------ | ------------------------------------------------------------ |</p>
<p>| 适合性     | 软件系统应该具备的功能是否有缺失以及是否做了额外的实现（功能少了吗，多了吗（画蛇添足）） | ATM自动存取款机：存款；取款；转账；查询。缺失：只做了存款取款和查询。额外的实现：存款；取款；转账；查询；天气预报。 |</p>
<p>| 准确性     | 软件系统的功能对数据处理的精准能力（对不对）                 | ATM自动存取款机：存款（20,000RMB，每次最多100张面值100的RMB）；取款（20,000RMB，每次最多3,000RMB，每天最多8次）；转账（同行同地转账50,000RMB）；查询（每天查询8次）。存款（最多50张100RMB）；取款；转账；查询 |</p>
<p>| 互操作性   | 软件系统和其他软件硬件的交互能力。                           | 微信的聊天可以发送图片（相册）；饿了么点外卖支付（支付宝；微信）；图形处理软件中的图片传送到手机。 |</p>
<p>| 安全保密性 | 信息安全（1.防止未被授权用户访问到未被授权信息；2.保证被授权用户能够访问到授权的信息） | 微信付账指纹（你的指纹可以确认付款；防止其他人的指纹确认付款）；银行转账50万元RMB（允许本人当天转账50万元RMB；防止其他人转你银行的账） |</p>
<p>| 功能依从性 |                                                              |                                                              |</p>
<p><em><strong>*（2）可靠性*</strong></em></p>
<p>| 子特性     | 说明                             | 举例                             |</p>
<p>| ---------- | -------------------------------- | -------------------------------- |</p>
<p>| 成熟性     | 内部存在的问题比较少             | 微信运行一年不闪退。             |</p>
<p>| 容错性     | 外部的异常操作，攻击的处理能力。 | 微信朋友圈每次试图添加十张图片。 |</p>
<p>| 易恢复性   | 对问题进行处理恢复正常的能力。   | 重启APP；重新启动操作系统。      |</p>
<p>| 可靠依从性 |                                  |                                  |</p>
<p><em><strong>*（3）效率*</strong></em></p>
<p>| 子特性     | 说明                                     | 举例                        |</p>
<p>| ---------- | ---------------------------------------- | --------------------------- |</p>
<p>| 时间       | 软件系统的某个功能运行的响应时间。       | ATM机群看5，000RMB3秒吐出； |</p>
<p>| 资源       | 软件系统运行或者某个功能运行资源占有率。 |                             |</p>
<p>| 效率依从性 |                                          |                             |</p>
<p><em><strong>*（4）易用性*</strong></em></p>
<p>| 子特性     | 说明                                     | 举例                                  |</p>
<p>| ---------- | ---------------------------------------- | ------------------------------------- |</p>
<p>| 易理解性   | 使用控件资源都一致，提示信息框没有误解。 | 快捷键；提示信息；Tooltip（工具贴士） |</p>
<p>| 易学性     | 提供软件系统学习的资料。                 | 帮助手册；用户手册；操作向导          |</p>
<p>| 易操作性   | 软件系统操作的步骤简单不繁琐。           | 苹果手机铃声设置                      |</p>
<p>| 易吸引性   | 吸引用户的能力                           | 标题党；                              |</p>
<p>| 易用依从性 |                                          |                                       |</p>
<p><em><strong>*（5）可移植性*</strong></em></p>
<p>| 子特性       | 说明                                                         | 举例                                                         |</p>
<p>| ------------ | ------------------------------------------------------------ | ------------------------------------------------------------ |</p>
<p>| 适应性       | 软件系统对不同环境的适应能力，环境发生变化对软件的修改比较少。 | 微信可以Andriod系统；IOS；Windows都可用。可以在不同版本的Andriod；IOS；Windows下可用。 |</p>
<p>| 易安装性     | 软件系统的安装步骤简单，能够在不同环境下进行安装，不需要做过多的安装配置。（卸载） | 手机App。                                                    |</p>
<p>| 易替换性     | 软件系统的升级、更新和打补丁。                               | 手机APP。                                                    |</p>
<p>| 共存性       | 在同一个环境下，类似软件共存的能力不能相互影响和抵制。       | 360和腾讯浏览器。                                            |</p>
<p>| 可移植依从性 |                                                              |                                                              |</p>
<p><em><strong>*（6）可维护性*</strong></em></p>
<p>| 子特性       | 说明                                                 | 举例                                                  |</p>
<p>| ------------ | ---------------------------------------------------- | ----------------------------------------------------- |</p>
<p>| 易分析性     | 出现缺陷或者bug，能够分析出来缺陷产生的原因。        | 注释行                                                |</p>
<p>| 易改变性     | 缺陷发生后有解决缺陷的方案。                         | 教学管理系统报表出错，找不到合适的解决方案。          |</p>
<p>| 稳定性       | 对缺陷修复之后造成的影响有多大。                     | 代码的耦合度要低                                      |</p>
<p>| 易测试性     | 能够被量化，能够编写测试用例，有能够确定的输入数据。 | ATM自动存取款机：存款一定金额；取款允许范围内的金额； |</p>
<p>| 可维护依从性 |                                                      |                                                       |</p>
<p><em><strong>*（7）依从性*</strong></em></p>
<p>对国家法律、行业法规、企业内部规则的遵守</p>
</div></template>
